# JOIN

In [29]:
import pandas as pd
# var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
# var2 = pd.DataFrame({"C":[10,20],"D":[11,22]})
var2 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])
# var2 = pd.DataFrame({"C":[10,20],"D":[11,22,33,44]}) this one is not gonna work
# var1.join(var2)
var2.join(var1,how="right",lsuffix="_12")
# var2.join(var1)

      C  B_12  A   B
a  10.0  11.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

# Append

In [39]:
var3 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var4 = pd.DataFrame({"C":[10,20],"B":[11,22]})
# var3.append(var4) append has benn removed
pd.concat([var3,var4],ignore_index=True)
# pd.concat([var3,var4])

     A   B     C
0  1.0  11   NaN
1  2.0  12   NaN
2  3.0  13   NaN
3  4.0  14   NaN
4  NaN  11  10.0
5  NaN  22  20.0